Plan Output:
```
OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

OpenTofu will perform the following actions:

  # module.encoretechnfr.jamfpro_icon.app_icons["Jamf Self Service"] must be replaced
-/+ resource "jamfpro_icon" "app_icons" {
      ~ icon_file_web_source = "https://icon-library.com/images/self-serve-icon/self-serve-icon-21.jpg" -> "https://is1-ssl.mzstatic.com/image/thumb/Purple221/v4/b1/12/2d/b1122db1-b6f5-ffc9-a04b-72bd9a132780/AppIcon-0-1x_U007emarketing-0-7-0-85-220-0.png/512x512bb.png" # forces replacement
      ~ id                   = "84" -> (known after apply)
      ~ name                 = "self-serve-icon-21.jpg" -> (known after apply)
      ~ url                  = "https://usw2.ics.services.jamfcloud.com/icon/hash_614aeadd432f7ab13e427c7ea911ea13efe12cac9880f394d1a3118341d5ddae" -> (known after apply)
    }

  # module.encoretechnfr.jamfpro_mobile_device_application.apps["Jamf Self Service"] will be updated in-place
  ~ resource "jamfpro_mobile_device_application" "apps" {
        id                                     = "58"
        name                                   = "Jamf Self Service"
        # (26 unchanged attributes hidden)

      ~ self_service {
            # (3 unchanged attributes hidden)

          ~ self_service_icon {
              ~ id  = 84 -> (known after apply)
                # (1 unchanged attribute hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sjndatacentylerpyooy.jamfpro_icon.app_icons["Jamf Self Service"] must be replaced
-/+ resource "jamfpro_icon" "app_icons" {
      ~ icon_file_web_source = "https://icon-library.com/images/self-serve-icon/self-serve-icon-21.jpg" -> "https://is1-ssl.mzstatic.com/image/thumb/Purple221/v4/b1/12/2d/b1122db1-b6f5-ffc9-a04b-72bd9a132780/AppIcon-0-1x_U007emarketing-0-7-0-85-220-0.png/512x512bb.png" # forces replacement
      ~ id                   = "19" -> (known after apply)
      ~ name                 = "self-serve-icon-21.jpg" -> (known after apply)
      ~ url                  = "https://use2.ics.services.jamfcloud.com/icon/hash_614aeadd432f7ab13e427c7ea911ea13efe12cac9880f394d1a3118341d5ddae" -> (known after apply)
    }

  # module.sjndatacentylerpyooy.jamfpro_mobile_device_application.apps["Jamf Self Service"] will be updated in-place
  ~ resource "jamfpro_mobile_device_application" "apps" {
        id                                     = "11"
        name                                   = "Jamf Self Service"
        # (26 unchanged attributes hidden)

      ~ self_service {
            # (3 unchanged attributes hidden)

          ~ self_service_icon {
              ~ id  = 19 -> (known after apply)
                # (1 unchanged attribute hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.
```

Apply:
```
module.sjndatacentylerpyooy.jamfpro_icon.app_icons["Jamf Self Service"]: Destroying... [id=19]
module.sjndatacentylerpyooy.jamfpro_icon.app_icons["Jamf Self Service"]: Destruction complete after 0s
module.sjndatacentylerpyooy.jamfpro_icon.app_icons["Jamf Self Service"]: Creating...
module.encoretechnfr.jamfpro_icon.app_icons["Jamf Self Service"]: Destroying... [id=84]
module.encoretechnfr.jamfpro_icon.app_icons["Jamf Self Service"]: Destruction complete after 0s
module.encoretechnfr.jamfpro_icon.app_icons["Jamf Self Service"]: Creating...
module.sjndatacentylerpyooy.jamfpro_icon.app_icons["Jamf Self Service"]: Creation complete after 2s [id=20]
module.sjndatacentylerpyooy.jamfpro_mobile_device_application.apps["Jamf Self Service"]: Modifying... [id=11]
module.sjndatacentylerpyooy.jamfpro_mobile_device_application.apps["Jamf Self Service"]: Modifications complete after 1s [id=11]
module.encoretechnfr.jamfpro_icon.app_icons["Jamf Self Service"]: Creation complete after 2s [id=85]
module.encoretechnfr.jamfpro_mobile_device_application.apps["Jamf Self Service"]: Modifying... [id=58]
module.encoretechnfr.jamfpro_mobile_device_application.apps["Jamf Self Service"]: Modifications complete after 0s [id=58]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 2 added, 2 changed, 2 destroyed.
```

Plan output after apply:
```
No changes. Your infrastructure matches the configuration.

OpenTofu has compared your real infrastructure against your configuration and found no differences, so no changes are needed.
```

